#                                                          .;;,
#                                     .,.               .,;;;;;,
#                                    ;;;;;;;,,        ,;;%%%%%;;
#                                     `;;;%%%%;;,.  ,;;%%;;%%%;;
#                                       `;%%;;%%%;;,;;%%%%%%%;;'
#                                         `;;%%;;%:,;%%%%%;;%%;;,
#                                            `;;%%%,;%%%%%%%%%;;;
#                                               `;:%%%%%%;;%%;;;'
#           ..,,,.                                 .:::::::.
#        .;;;;;;;;;;,.                                  s.
#        `;;;;;;;;;;;;;,                               ,SSSs.
#          `:.:.:.:.:.:.:.                            ,SSSSSSs.
#           .;;;;;;;;;;;;;::,                        ,SSSSSSSSS,
#          ;;;;;;;;;;;;;;;;:::%,                    ,SS%;SSSSSSsS
#         ;;;;;;,:,:::::::;::::%%,                  SS%;SSSSSSsSS
#         ;;;;;,::a@@@@@@a::%%%%%%%,.   ...         SS%;SSSSSSSS'
#         `::::::@@@@@@@@@@@a;%%%%%%%%%'  #;        `SS%;SSSSS'
#  .,sSSSSs;%%,::@@@@@@;;' #`@@a;%%%%%'   ,'          `S%;SS'
#sSSSSSSSSSs;%%%,:@@@@a;;   .@@@a;%%sSSSS'           .%%%;SS,
#`SSSSSSSSSSSs;%%%,:@@@a;;;;@@@;%%sSSSS'        ..,,%%%;SSSSSSs.
#  `SSSSSSSSSSSSs;%%,%%%%%%%%%%%SSSS'     ..,,%;sSSS;%;SSSSSSSSs.
#     `SSSSSSSSSSS%;%;sSSSS;""""   ..,,%sSSSS;;SSSS%%%;SSSSSSSSSS.
#         """""" %%;SSSSSS;;%..,,sSSS;%SSSSS;%;%%%;%%%%;SSSSSS;SSS.
#                `;SSSSS;;%%%%%;SSSS;%%;%;%;sSSS;%%%%%%%;SSSSSS;SSS
#                 ;SSS;;%%%%%%%%;%;%sSSSS%;SSS;%%%%%%%%%;SSSSSS;SSS
#                 `S;;%%%%%%%%%%%%%SSSSS;%%%;%%%%%%%%%%%;SSSSSS;SSS
#                  ;SS;%%%%%%%%%%%%;%;%;%%;%%%%%%%%%%%%;SSSSSS;SSS'
#                  SS;%%%%%%%%%%%%%%%%%%%;%%%%%%%%%%%;SSSSSS;SSS'
#                  SS;%%%%%%%%%%%%%%%%%%;%%%%%%%%%%%;SSSSS;SSS'
#                  SS;%%%%%%%%%%%%%;sSSs;%%%%%%%%;SSSSSS;SSSS
#                  `SS;%%%%%%%%%%%%%%;SS;%%%%%%;SSSSSS;SSSS'
#                   `S;%%%%%%%%%%%%%%%;S;%%%%%;SSSS;SSSSS%
#                    `S;%;%%%%%%%%%%%'   `%%%%;SSS;SSSSSS%.
#                  ,S;%%%%%%%%%%;'      `%%%%%;S   `SSSSs%,.
#                  ,%%%%%%%%%%;%;'         `%;%%%;     `SSSs;%%,.
#               ,%%%%%%;;;%;;%;'           .%%;%%%       `SSSSs;%%.
#            ,%%%%%' .%;%;%;'             ,%%;%%%'         `SSSS;%%
#          ,%%%%'   .%%%%'              ,%%%%%'             `SSs%%'
#        ,%%%%'    .%%%'              ,%%%%'                ,%%%'
#      ,%%%%'     .%%%              ,%%%%'                 ,%%%'
#    ,%%%%'      .%%%'            ,%%%%'                  ,%%%'
#  ,%%%%'        %%%%           ,%%%'                    ,%%%%
#  %%%%'       .:::::         ,%%%'                      %%%%'
#.:::::        :::::'       ,%%%'                       ,%%%%
#:::::'                   ,%%%%'                        %%%%%
#                        %%%%%'                         %%%%%
#                      .::::::                        .::::::
#                      ::::::'                        ::::::'
#
####################################################################
#       Brewfile — personal macOS setup (Apple Silicon)
#       Est. 2026-03-28 Happy BirthDay!
#
#       Usage:
#         brew bundle              # install everything
#         brew bundle check        # verify all installed
#         brew bundle cleanup      # remove unlisted packages
####################################################################

####################################################################
#  Taps
####################################################################

tap "1password/tap"
tap "ankitpokhrel/jira-cli"
tap "charmbracelet/tap"
tap "dokku/repo"
tap "domcyrus/rustnet"
tap "eyeplum/tap"
tap "italolelis/reachable"
tap "jesseduffield/lazygit"
tap "kalissaac/tap"
tap "openhue/cli"
tap "pulumi/tap"
tap "rebelice/tap"
tap "shinokada/tera"
tap "steipete/tap"

####################################################################
#  Formulae — Shell & Terminal
####################################################################

brew "bash"                      # not needed but keeps it up to date
brew "bash-completion@2"
brew "coreutils"
brew "less"
brew "most"
brew "thefuck"
brew "zoxide"

####################################################################
#  Formulae — Editors
####################################################################

brew "micro"
brew "nano"

####################################################################
#  Formulae — Git & Version Control
####################################################################

brew "git"
brew "gh"
brew "git-filter-repo"
brew "gitleaks"
brew "gitup"
brew "diff-so-fancy"

####################################################################
#  Formulae — File Managers & Navigation
####################################################################

brew "midnight-commander"
brew "nnn"
brew "superfile"
brew "xplr"
brew "yazi"
brew "fd"
brew "eza"
brew "tre"

####################################################################
#  Formulae — Search & Text Processing
####################################################################

brew "the_silver_searcher"
brew "jq"
brew "sd"
brew "xsv"
brew "csvkit"
brew "csvq"
brew "peco"

####################################################################
#  Formulae — System Monitoring
####################################################################

brew "btop"
brew "htop"
brew "ctop"
brew "glances"
brew "procs"
brew "dua-cli"
brew "duf"
brew "ncdu"
brew "fastfetch"
brew "neofetch"
brew "mufetch"

####################################################################
#  Formulae — Containers & Virtualization
####################################################################

brew "colima"
brew "container"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "lazycontainer"
brew "lazydocker"
brew "minikube"
brew "qemu"
brew "socket_vmnet"

####################################################################
#  Formulae — TUI Tools (lazy* family & friends)
####################################################################

brew "lazygit"
brew "lazyjournal"
brew "lazysql"
brew "lazyssh"
brew "rebelice/tap/lazypg"

####################################################################
#  Formulae — Networking & HTTP
####################################################################

brew "httpie"
brew "lynx"
brew "chawan"
brew "wget"
brew "lftp"
brew "gping"
brew "cloudflared"
brew "tmate"
brew "xxh"
brew "italolelis/reachable/reachable"
brew "domcyrus/rustnet/rustnet"

####################################################################
#  Formulae — Cloud & Infrastructure
####################################################################

brew "ansible"
brew "azure-cli"
brew "doctl"
brew "hcloud"
brew "helm"
brew "pulumi/tap/pulumi"
brew "dokku/repo/dokku"

####################################################################
#  Formulae — AI & LLM
####################################################################

brew "ollama"
brew "charmbracelet/tap/crush"
brew "charmbracelet/tap/mods"
brew "charmbracelet/tap/skate"
brew "charmbracelet/tap/wishlist"
brew "opencode"
brew "llm"
brew "hf"
brew "steipete/tap/summarize"

####################################################################
#  Formulae — Databases
####################################################################

brew "duckdb"
brew "harlequin"
brew "mysql-client"
brew "pgformatter"
brew "sqruff"

####################################################################
#  Formulae — Languages & Dev Tools
####################################################################

brew "go-task"
brew "golangci-lint"
brew "gopls"
brew "just"
brew "pipx"
brew "pnpm"
brew "pyenv"
brew "ruff-lsp"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "act"

####################################################################
#  Formulae — Documents & Presentation
####################################################################

brew "glow"
brew "mdformat"
brew "pandoc"
brew "slides"
brew "typst"
brew "vhs"

####################################################################
#  Formulae — Media & Graphics
####################################################################

brew "asciinema"
brew "autotrace"
brew "diff-pdf"
brew "fileicon"
brew "gdal"
brew "graphviz"
brew "jp2a"
brew "lolcat"
brew "optipng"
brew "potrace"
brew "resvg"
brew "youtubedr"

####################################################################
#  Formulae — Security & Passwords
####################################################################

brew "hashcat"
brew "mkcert"
brew "oath-toolkit"
brew "pass"
brew "pinentry-mac"
brew "pwgen"
brew "sherlock"
brew "sshpass"

####################################################################
#  Formulae — Miscellaneous CLI
####################################################################

brew "align"
brew "azcopy"
brew "bat"
brew "bear"
brew "brew-gem"
brew "buku"
brew "bzip2"
brew "ccat"
brew "cheat"
brew "ddgr"
brew "entr"
brew "eyeplum/tap/cicero-tui"
brew "file-formula"
brew "hledger"
brew "html2text"
brew "hyperfine"
brew "ankitpokhrel/jira-cli/jira-cli"
brew "jdupes"
brew "khal"
brew "lnav"
brew "mas"
brew "monit"
brew "navi"
brew "newsboat"
brew "openhue/cli/openhue-cli"
brew "p7zip"
brew "rm-improved"
brew "scc"
brew "shinokada/tera/tera"
brew "stormy"
brew "tidy-html5"
brew "tldr"
brew "todo-txt"
brew "translate-shell"
brew "weasyprint"
brew "xcv"
brew "xsel"
brew "aria2"
brew "cmus"

####################################################################
#  Casks — Browsers
####################################################################

cask "google-chrome"
cask "opera"
cask "zen"

####################################################################
#  Casks — Editors & IDEs
####################################################################

cask "coteditor"
cask "sublime-text"
cask "visual-studio-code"
cask "zed"

####################################################################
#  Casks — Dev Tools
####################################################################

cask "1password-cli"
cask "clickhouse"
cask "codexbar"
cask "container"
cask "dbeaver-community"
cask "github-copilot-for-xcode"
cask "mysql-shell"
cask "tableplus"
cask "wireshark-chmodbpf"

####################################################################
#  Casks — Diff & Merge
####################################################################

cask "diffmerge"
cask "kalissaac-eigen"

####################################################################
#  Casks — System Utilities
####################################################################

cask "adguard"
cask "appcleaner"
cask "cleanmymac"
cask "devutils"
cask "espanso"
cask "hiddenbar"
cask "homerow"
cask "keepingyouawake"
cask "monitorcontrol"
cask "raycast"

####################################################################
#  Casks — Media & Graphics
####################################################################

cask "diffusionbee"
cask "iina"

####################################################################
#  Casks — Communication & Other Apps
####################################################################

cask "deltachat"
cask "imazing"
cask "macpass"
cask "obsidian"
cask "rustdesk"
cask "transmission"

####################################################################
#  Casks — Disk & System Images
####################################################################

cask "balenaetcher"

####################################################################
#  Casks — Typesetting & Documents
####################################################################

cask "basictex"
cask "prince"
cask "wkhtmltopdf"

####################################################################
#  Casks — Cloud CLI
####################################################################

cask "gcloud-cli"

####################################################################
#  Casks — Quick Look Plugins
####################################################################

cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-json"
cask "syntax-highlight"

####################################################################
#  Mac App Store
####################################################################

mas "Keynote", id: 361285480
mas "NeoServer", id: 6448362669
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Pixelmator Pro", id: 1289583905
mas "ServerCat", id: 1501532023
mas "SnippetsLab", id: 1006087419
mas "SwiftServer", id: 6740036221
mas "Windows App", id: 1295203466
mas "Xcode", id: 497799835
